emacs/emacs-study.org
#+TITLE: emacs-study历程
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../style/my-org-worg.css" />

* emacs安装
** windows
+ 下载安装包
#+BEGIN_EXAMPLE
gnu网站http://ftp.gnu.org/gnu/emacs/windows下载windows对应的emacs版本

http://ftp.gnu.org/gnu/emacs/windows/emacs-24.5-bin-i686-mingw32.zip
#+END_EXAMPLE

+ 安装
#+BEGIN_EXAMPLE
emacs-24.5-bin-i686-mingw32.zip为二进制bin版本，直接解压就可以使用
#+END_EXAMPLE

+ 配置PATH环境变量
#+BEGIN_EXAMPLE
如：将emacs安装目录的bin目录C:\Local\Program Files\emacs\bin添加到PATH环境变量中
#+END_EXAMPLE

+ emacs默认信息
#+BEGIN_EXAMPLE
家目录HOME：C:\Users\用户名\AppData\Roaming\

启动加载配置目录：%HOME%\.emacs.d

启动加载配置文件：%HOME%\.emacs

.emacs.d目录和.emacs文件两选一，.emacs文件为老式的启动方式，目前兼容，不利于插件包的管理

比较优秀的方式是采用.emacs.d目录控制emacs插件包
#+END_EXAMPLE

+ emacs启动
#+BEGIN_EXAMPLE
创建runemacs.exe的快捷方式到桌面，右键 --> 属性 --> 起始位置
#+END_EXAMPLE

** linux


* spacemacs安装
** windows
+ 安装spacemacs
#+BEGIN_EXAMPLE
直接从git上下载代码到用户的家目录中，并取名为.emacs.d，

如果之前运行过emacs，且windows的家目录下有.emacs文件和.emacs.d目录，请删除掉

windows的家目录一般为C:\Users\用户名\AppData\Roaming\

git clone https://github.com/syl20bnr/spacemacs.git C:\Users\carhj\AppData\Roaming\.emacs.d
#+END_EXAMPLE

+ 启动emacs
#+BEGIN_EXAMPLE

spacemacs采用.emacs.d目录来控制emacs了，无需.emacs文件了

1 选择emacs模式

2 选择standard(spacemacs)

3 选择full-featured(helm)

4 第一次启动后，然后关闭emacs

5 HOME目录下会自动生成C:\Users\carhj\AppData\Roaming\.spacemacs这个文件
#+END_EXAMPLE

+ .spacemacs文件配置
#+BEGIN_EXAMPLE
用现有的模板文件.spacemacs覆盖掉HOME目录下的.spacemacs,也可以自己慢慢维护.spacemacs文件
#+END_EXAMPLE

+ 相关工具的安装

#+BEGIN_EXAMPLE
1. 安装 source code font 字体
   https://github.com/adobe-fonts/source-code-pro/downloads 下载 source code font 字体
   TTF下所有文件拷贝到c:/windows/font

2. 安装 zlib
   http://gnuwin32.sourceforge.net/packages/zlib.htm 下载windows版本的zlib
   安装zlib，一路回车法，将安装后的bin添加到PATH环境变量中去

3. 安装 aspell
   http://aspell.net/win32/ 下载Aspell-0-50-3-3-Setup.exe，Aspell-en-0.50-2-3.exe两个软件
   先安装Aspell-0-50-3-3-Setup.exe，再安装Aspell-en-0.50-2-3.exe（属于字典库）
   安装后的bin添加到PATH环境变量中去

4. 安装 diff
   https://sourceforge.net/projects/kdiff3/files/kdiff3/0.9.98/ 
   下载KDiff3-64bit-Setup_0.9.98-2.exe
   一路回车法安装diff
   安装后的bin添加到PATH环境变量中去
#+END_EXAMPLE

+ issue
#+BEGIN_EXAMPLE
1 evil-unimpaired安装不了
  github网络问题，evil-unimpaire不容易装上,手工下载melpa后,放入到emacs.d\.cache\quelpa\目录下,
  重启emacs

  

#+END_EXAMPLE
** linux


* org-mode
+ 文档标题
#+BEGIN_EXAMPLE
#+TITLE: 文档标题名
#+END_EXAMPLE

+ 引入外部css文件
#+BEGIN_EXAMPLE
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../style/my-org-worg.css" />
#+END_EXAMPLE



* tramp
+ tramp简介
#+BEGIN_EXAMPLE
tramp主要实现远程访问Linux服务器，可以直接编辑远程服务器上的文件的了
#+END_EXAMPLE

+ 安装
#+BEGIN_EXAMPLE
1 安装 tramp 包
2 安装plink.exe，将plink.exe放置到emacs的bin目录下
  plink.exe从ssh的客户端工具putty中拷贝过来
#+END_EXAMPLE

+ 配置
#+BEGIN_EXAMPLE
(require 'tramp)
(setq tramp-default-method "plink")
例如：spacemacs中
     在dotspacemacs/user-config ()函数中加入上面代码
#+END_EXAMPLE

+ 操作方式
#+BEGIN_EXAMPLE
/user@ip:
#+END_EXAMPLE

+ issue
#+BEGIN_EXAMPLE
首次要在windows的cmd行下，运用plink访问一次目标主机，否则因为没有添加公钥会一直卡死
#+END_EXAMPLE


* issue
** windows
+ Error: (file-error “Searching for program” “no such file or directory” “diff”)
#+BEGIN_EXAMPLE
需要安装diff工具
下载https://sourceforge.net/projects/kdiff3/files/kdiff3/0.9.98/
安装KDiff3-64bit-Setup_0.9.98-2.exe，并将配置到环境变量中去
#+END_EXAMPLE


+ The directory ~/.emacs.d/server is unsafe
#+BEGIN_EXAMPLE
~/.emacs.d/server 目录属主修改为当前用户
右键 --> 属性 --> 安全 --> 高级 -->修改所有者
#+END_EXAMPLE

+ javascript格式化代码
#+BEGIN_EXAMPLE
npm -g install js-beautify
#+END_EXAMPLE

** linux
