emacs/emacs-study.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-12-24 周六 19:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>emacs-study历程</title>
<meta name="generator" content="Org mode" />

<link rel="stylesheet" type="text/css" href="../style/my-org-worg.css" />

</head>
<body>
<div id="content">
<h1 class="title">emacs-study历程</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org72de022">1. emacs安装</a>
<ul>
<li><a href="#orgbe649a0">1.1. windows</a></li>
<li><a href="#org3b22628">1.2. linux</a></li>
</ul>
</li>
<li><a href="#org31377c8">2. spacemacs安装</a>
<ul>
<li><a href="#org6bc697f">2.1. windows</a></li>
<li><a href="#org601ef71">2.2. linux</a></li>
</ul>
</li>
<li><a href="#org0149d34">3. org-mode</a></li>
<li><a href="#org0c05486">4. tramp</a></li>
<li><a href="#org1e78b6a">5. issue</a>
<ul>
<li><a href="#org9f92f17">5.1. windows</a></li>
<li><a href="#orgbea1477">5.2. linux</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org72de022" class="outline-2">
<h2 id="org72de022"><span class="section-number-2">1</span> emacs安装</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgbe649a0" class="outline-3">
<h3 id="orgbe649a0"><span class="section-number-3">1.1</span> windows</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>下载安装包</li>
</ul>
<pre class="example">
gnu网站http://ftp.gnu.org/gnu/emacs/windows下载windows对应的emacs版本

http://ftp.gnu.org/gnu/emacs/windows/emacs-24.5-bin-i686-mingw32.zip
</pre>

<ul class="org-ul">
<li>安装</li>
</ul>
<pre class="example">
emacs-24.5-bin-i686-mingw32.zip为二进制bin版本，直接解压就可以使用
</pre>

<ul class="org-ul">
<li>配置PATH环境变量</li>
</ul>
<pre class="example">
如：将emacs安装目录的bin目录C:\Local\Program Files\emacs\bin添加到PATH环境变量中
</pre>

<ul class="org-ul">
<li>emacs默认信息</li>
</ul>
<pre class="example">
家目录HOME：C:\Users\用户名\AppData\Roaming\

启动加载配置目录：%HOME%\.emacs.d

启动加载配置文件：%HOME%\.emacs

.emacs.d目录和.emacs文件两选一，.emacs文件为老式的启动方式，目前兼容，不利于插件包的管理

比较优秀的方式是采用.emacs.d目录控制emacs插件包
</pre>

<ul class="org-ul">
<li>emacs启动</li>
</ul>
<pre class="example">
创建runemacs.exe的快捷方式到桌面，右键 --&gt; 属性 --&gt; 起始位置
</pre>
</div>
</div>

<div id="outline-container-org3b22628" class="outline-3">
<h3 id="org3b22628"><span class="section-number-3">1.2</span> linux</h3>
</div>
</div>


<div id="outline-container-org31377c8" class="outline-2">
<h2 id="org31377c8"><span class="section-number-2">2</span> spacemacs安装</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org6bc697f" class="outline-3">
<h3 id="org6bc697f"><span class="section-number-3">2.1</span> windows</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>安装spacemacs</li>
</ul>
<pre class="example">
直接从git上下载代码到用户的家目录中，并取名为.emacs.d，

如果之前运行过emacs，且windows的家目录下有.emacs文件和.emacs.d目录，请删除掉

windows的家目录一般为C:\Users\用户名\AppData\Roaming\

git clone https://github.com/syl20bnr/spacemacs.git C:\Users\carhj\AppData\Roaming\.emacs.d
</pre>

<ul class="org-ul">
<li>启动emacs</li>
</ul>
<pre class="example">
spacemacs采用.emacs.d目录来控制emacs了，无需.emacs文件了

1 选择emacs模式

2 选择standard(spacemacs)

3 选择full-featured(helm)

4 第一次启动后，然后关闭emacs

5 HOME目录下会自动生成C:\Users\carhj\AppData\Roaming\.spacemacs这个文件
</pre>

<ul class="org-ul">
<li>.spacemacs文件配置</li>
</ul>
<pre class="example">
用现有的模板文件.spacemacs覆盖掉HOME目录下的.spacemacs,也可以自己慢慢维护.spacemacs文件
</pre>

<ul class="org-ul">
<li>相关工具的安装</li>
</ul>

<pre class="example">
1. 安装 source code font 字体
   https://github.com/adobe-fonts/source-code-pro/downloads 下载 source code font 字体
   TTF下所有文件拷贝到c:/windows/font

2. 安装 zlib
   http://gnuwin32.sourceforge.net/packages/zlib.htm 下载windows版本的zlib
   安装zlib，一路回车法，将安装后的bin添加到PATH环境变量中去

3. 安装 aspell
   http://aspell.net/win32/ 下载Aspell-0-50-3-3-Setup.exe，Aspell-en-0.50-2-3.exe两个软件
   先安装Aspell-0-50-3-3-Setup.exe，再安装Aspell-en-0.50-2-3.exe（属于字典库）
   安装后的bin添加到PATH环境变量中去

4. 安装 diff
   https://sourceforge.net/projects/kdiff3/files/kdiff3/0.9.98/ 
   下载KDiff3-64bit-Setup_0.9.98-2.exe
   一路回车法安装diff
   安装后的bin添加到PATH环境变量中去
</pre>

<ul class="org-ul">
<li>issue</li>
</ul>
<pre class="example">
1 evil-unimpaired安装不了
  github网络问题，evil-unimpaire不容易装上,手工下载melpa后,放入到emacs.d\.cache\quelpa\目录下,
  重启emacs
</pre>
</div>
</div>
<div id="outline-container-org601ef71" class="outline-3">
<h3 id="org601ef71"><span class="section-number-3">2.2</span> linux</h3>
</div>
</div>


<div id="outline-container-org0149d34" class="outline-2">
<h2 id="org0149d34"><span class="section-number-2">3</span> org-mode</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>文档标题</li>
</ul>
<pre class="example">
#+TITLE: 文档标题名
</pre>

<ul class="org-ul">
<li>引入外部css文件</li>
</ul>
<pre class="example">
#+HTML_HEAD: &lt;link rel="stylesheet" type="text/css" href="../style/my-org-worg.css" /&gt;
</pre>
</div>
</div>



<div id="outline-container-org0c05486" class="outline-2">
<h2 id="org0c05486"><span class="section-number-2">4</span> tramp</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>tramp简介</li>
</ul>
<pre class="example">
tramp主要实现远程访问Linux服务器，可以直接编辑远程服务器上的文件的了
</pre>

<ul class="org-ul">
<li>安装</li>
</ul>
<pre class="example">
1 安装 tramp 包
2 安装plink.exe，将plink.exe放置到emacs的bin目录下
  plink.exe从ssh的客户端工具putty中拷贝过来
</pre>

<ul class="org-ul">
<li>配置</li>
</ul>
<pre class="example">
(require 'tramp)
(setq tramp-default-method "plink")
例如：spacemacs中
     在dotspacemacs/user-config ()函数中加入上面代码
</pre>

<ul class="org-ul">
<li>操作方式</li>
</ul>
<pre class="example">
/user@ip:
</pre>

<ul class="org-ul">
<li>issue</li>
</ul>
<pre class="example">
首次要在windows的cmd行下，运用plink访问一次目标主机，否则因为没有添加公钥会一直卡死
</pre>
</div>
</div>


<div id="outline-container-org1e78b6a" class="outline-2">
<h2 id="org1e78b6a"><span class="section-number-2">5</span> issue</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-org9f92f17" class="outline-3">
<h3 id="org9f92f17"><span class="section-number-3">5.1</span> windows</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>Error: (file-error “Searching for program” “no such file or directory” “diff”)</li>
</ul>
<pre class="example">
需要安装diff工具
下载https://sourceforge.net/projects/kdiff3/files/kdiff3/0.9.98/
安装KDiff3-64bit-Setup_0.9.98-2.exe，并将配置到环境变量中去
</pre>


<ul class="org-ul">
<li>The directory ~/.emacs.d/server is unsafe</li>
</ul>
<pre class="example">
~/.emacs.d/server 目录属主修改为当前用户
右键 --&gt; 属性 --&gt; 安全 --&gt; 高级 --&gt;修改所有者
</pre>

<ul class="org-ul">
<li>javascript格式化代码</li>
</ul>
<pre class="example">
npm -g install js-beautify
</pre>
</div>
</div>

<div id="outline-container-orgbea1477" class="outline-3">
<h3 id="orgbea1477"><span class="section-number-3">5.2</span> linux</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2016-12-24 周六 19:44</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
